pmo-dataset/variations/mermaid_with_ids/10.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Install the solution"]
	Task_2["Assess compatibility"]
	Task_3["Evaluate cost and\nresource needs"]
	Task_4["Procure necessary\ntools or licenses"]
	Task_5["Submit IT solution\nrequest"]
	Task_6["Test solution"]
	Task_7["Roll out solution to\nrequesting\ndepartment"]
	Task_8["Provide training"]
	Task_9["Provide support for\ntroubleshooting"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ExclusiveGateway_5{"X"}
	ExclusiveGateway_6{"X"}
	ExclusiveGateway_7{"X"}
	ExclusiveGateway_8{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}
	ParallelGateway_4{"+"}

	Task_9 --> ExclusiveGateway_3
	ParallelGateway_2 --> ExclusiveGateway_6
	Task_4 --> Task_1
	ParallelGateway_4 --> ExclusiveGateway_5
	ExclusiveGateway_4 --> ParallelGateway_4
	ParallelGateway_1 --> Task_2
	ParallelGateway_2 --> ExclusiveGateway_7
	Task_6 --> Task_7
	ExclusiveGateway_2 --> Task_9
	ExclusiveGateway_1 --> ExclusiveGateway_5
	Task_2 --> ParallelGateway_3
	Task_3 --> ParallelGateway_3
	ExclusiveGateway_1 --> Task_4
	ExclusiveGateway_3 --> ExclusiveGateway_8
	ExclusiveGateway_3 --> ExclusiveGateway_2
	ExclusiveGateway_7 --> Task_8
	Task_5 --> ParallelGateway_1
	ParallelGateway_3 --> ExclusiveGateway_1
	ExclusiveGateway_5 --> EndNoneEvent_1
	StartNoneEvent_1 --> Task_5
	Task_1 --> Task_6
	Task_7 --> ParallelGateway_2
	Task_8 --> ExclusiveGateway_4
	ExclusiveGateway_7 --> ExclusiveGateway_4
	ExclusiveGateway_6 --> ExclusiveGateway_2
	ExclusiveGateway_8 --> ParallelGateway_4
	ParallelGateway_1 --> Task_3
	ExclusiveGateway_6 --> ExclusiveGateway_8
